---
kind: method
id: M:Autodesk.Revit.DB.CADLinkOptions.#ctor(Autodesk.Revit.DB.CADLinkOptions)
source: html/56d08495-2406-b1aa-f013-6813f97b78e9.htm
---
# Autodesk.Revit.DB.CADLinkOptions.#ctor Method

Constructs a new copy of the input CADLinkOptions object.

## Syntax (C#)
```csharp
public CADLinkOptions(
	CADLinkOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.CADLinkOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null